% x = [0.1,0.2,0.5,1,2,4,8,12,16,20];
% y1 = [37 64 134 257 471 832 1442 1955 2410 2810];
% y2 = [23 43 98 201 390 753 1421 2020 2570 3090];
% size(x)
% size(y1)
% size(y2)
% plot(x,y1,'b*--')
% hold on
% plot(x,y2,'r*-')
% title('蓝色和白色高亮LED电光特性图')
% xlabel('电流大小/mA')
% ylabel('照度大小')
% legend('蓝色高亮','白色高亮')
% grid on
clc
clear
% x = [1 2 5 10 20 40 80 120 160 200]
% y1 = [1 10 37 84 172 343 660 963 1232 1491]
% y2 = [3 14 50 109 230 462 906 1325 1925 2100]
% plot(x,y1,'b*--')
% hold on
% plot(x,y2,'r*-')
% title('蓝色和白色功率LED电光特性图')
% xlabel('电流大小/mA')
% ylabel('照度大小')
% legend('蓝色功率','白色功率')
% grid on
% theta = (([-14:2:14]/360)*2*pi)+pi/2
% rho1 = [46 102 462 634 863 1180 1534 2900 2070 1345 1072 521 201 86 73];
% size(rho1)
% polarplot(theta,rho1,'r*-')
% thetalim([0 180])
% title('红色高亮LED空间分布特性')
% rho2 = [122 458 1111 1897 2600 2670 2840 3170 2800 2250 1770 863 636 375 124]
% size(rho2)
% polarplot(theta,rho1,'g*-')
% thetalim([0 180])
% title('绿色高亮LED空间分布特性')
rho3 = [775 929 1064 1163 1180 1201 1232 1264 1216 1108 969 759 566 280 46]
rho4 = [699 953 1122 1237 1327 1370 1395 1401 1395 1352 1322 1314 1230 924 530]
theta2 = (([-70:10:70]/360)*2*pi)+pi/2
polarplot(theta2,rho3,'r*-')
thetalim([0 180])
title('红色功率LED空间分布特性')
polarplot(theta2,rho4,'g*-')
thetalim([0 180])
title('绿色功率LED空间分布特性')